sj15712795029/stm32_sdio_wifi_marvell8801_wifi/1-STM32F1_WIFI_综合例程/component/wifi/marvell88w8801_core.h
/** Data structure for subband set */
typedef  struct _IEEEtypes_SubbandSet_t
{
    /** First channel */
    uint8_t first_chan;
    /** Number of channels */
    uint8_t no_of_chan;
    /** Maximum Tx power in dBm */
    uint8_t max_tx_pwr;
}  MLAN_PACK_END IEEEtypes_SubbandSet_t, *pIEEEtypes_SubbandSet_t;

typedef struct
{
    /** Capability information */
    //IEEEtypes_CapInfo_t Capability;
    uint16_t Capability;
    /** Association response status code */
    IEEEtypes_StatusCode_t StatusCode;
    /** Association ID */
    IEEEtypes_AId_t AId;
    /** IE data buffer */
    uint8_t IEBuffer[1];
}  MLAN_PACK_END IEEEtypes_AssocRsp_t;

/** IEEEtypes_CfParamSet_t */
typedef  struct _IEEEtypes_CfParamSet_t
{
    /** CF peremeter : Element ID */
    uint8_t element_id;
    /** CF peremeter : Length */
    uint8_t len;
    /** CF peremeter : Count */
    uint8_t cfp_cnt;
    /** CF peremeter : Period */
    uint8_t cfp_period;
    /** CF peremeter : Maximum duration */
    uint16_t cfp_max_duration;
    /** CF peremeter : Remaining duration */
    uint16_t cfp_duration_remaining;
}  MLAN_PACK_END IEEEtypes_CfParamSet_t, *pIEEEtypes_CfParamSet_t;

/** IEEEtypes_IbssParamSet_t */
typedef  struct _IEEEtypes_IbssParamSet_t
{
    /** Element ID */
    uint8_t element_id;
    /** Length */
    uint8_t len;
    /** ATIM window value in milliseconds */
    uint16_t atim_window;
}  MLAN_PACK_END IEEEtypes_IbssParamSet_t, *pIEEEtypes_IbssParamSet_t;

/** IEEEtypes_SsParamSet_t */
typedef  union _IEEEtypes_SsParamSet_t
{
    /** SS parameter : CF parameter set */
    IEEEtypes_CfParamSet_t cf_param_set;
    /** SS parameter : IBSS parameter set */
    IEEEtypes_IbssParamSet_t ibss_param_set;
} MLAN_PACK_END  IEEEtypes_SsParamSet_t, *pIEEEtypes_SsParamSet_t;

/** IEEEtypes_FhParamSet_t */
typedef  struct _IEEEtypes_FhParamSet_t
{
    /** FH parameter : Element ID */
    uint8_t element_id;
    /** FH parameter : Length */
    uint8_t len;
    /** FH parameter : Dwell time in milliseconds */
    uint16_t dwell_time;
    /** FH parameter : Hop set */
    uint8_t hop_set;
    /** FH parameter : Hop pattern */
    uint8_t hop_pattern;
    /** FH parameter : Hop index */
    uint8_t hop_index;
}  MLAN_PACK_END IEEEtypes_FhParamSet_t, *pIEEEtypes_FhParamSet_t;

/** IEEEtypes_DsParamSet_t */
typedef  struct _IEEEtypes_DsParamSet_t
{
    /** DS parameter : Element ID */
    uint8_t element_id;
    /** DS parameter : Length */
    uint8_t len;
    /** DS parameter : Current channel */
    uint8_t current_chan;
}  MLAN_PACK_END IEEEtypes_DsParamSet_t, *pIEEEtypes_DsParamSet_t;

/** IEEEtypes_PhyParamSet_t */
typedef  union _IEEEtypes_PhyParamSet_t
{
    /** FH parameter set */
    IEEEtypes_FhParamSet_t fh_param_set;
    /** DS parameter set */
    IEEEtypes_DsParamSet_t ds_param_set;
}  MLAN_PACK_END IEEEtypes_PhyParamSet_t, *pIEEEtypes_PhyParamSet_t;

/** Vendor specific IE header */
typedef struct _IEEEtypes_VendorHeader_t
{
    /** Element ID */
    uint8_t element_id;
    /** Length */
    uint8_t len;
    /** OUI */
    uint8_t oui[3];
    /** OUI type */
    uint8_t oui_type;
    /** OUI subtype */
    uint8_t oui_subtype;
    /** Version */
    uint8_t version;
}  MLAN_PACK_END IEEEtypes_VendorHeader_t, *pIEEEtypes_VendorHeader_t;

/** Data structure of WMM QoS information */
typedef struct _IEEEtypes_WmmQosInfo_t
{

    /** Parameter set count */
    uint8_t para_set_count:4;
    /** Reserved */
    uint8_t reserved:3;
    /** QoS UAPSD */
    uint8_t qos_uapsd:1;
}  MLAN_PACK_END IEEEtypes_WmmQosInfo_t, *pIEEEtypes_WmmQosInfo_t;

/** Data structure of WMM Aci/Aifsn */
typedef struct _IEEEtypes_WmmAciAifsn_t
{

    /** Aifsn */
    uint8_t aifsn:4;
    /** Acm */
    uint8_t acm:1;
    /** Aci */
    uint8_t aci:2;
    /** Reserved */
    uint8_t reserved:1;

} MLAN_PACK_END  IEEEtypes_WmmAciAifsn_t, *pIEEEtypes_WmmAciAifsn_t;

/** Data structure of WMM ECW */
typedef struct _IEEEtypes_WmmEcw_t
{

    /** Minimum Ecw */
    uint8_t ecw_min:4;
    /** Maximum Ecw */
    uint8_t ecw_max:4;

} MLAN_PACK_END  IEEEtypes_WmmEcw_t, *pIEEEtypes_WmmEcw_t;

/** Data structure of WMM AC parameters  */
typedef struct _IEEEtypes_WmmAcParameters_t
{
    IEEEtypes_WmmAciAifsn_t aci_aifsn;  /**< AciAifSn */
    IEEEtypes_WmmEcw_t ecw;		    /**< Ecw */
    uint16_t tx_op_limit;		    /**< Tx op limit */
} MLAN_PACK_END  IEEEtypes_WmmAcParameters_t, *pIEEEtypes_WmmAcParameters_t;


/** Data structure of WMM parameter IE  */
typedef struct _IEEEtypes_WmmParameter_t
{
    /**
     * WMM Parameter IE - Vendor Specific Header:
     *   element_id  [221/0xdd]
     *   Len         [24]
     *   Oui         [00:50:f2]
     *   OuiType     [2]
     *   OuiSubType  [1]
     *   Version     [1]
     */
    IEEEtypes_VendorHeader_t vend_hdr;

    /** QoS information */
    IEEEtypes_WmmQosInfo_t qos_info;
    /** Reserved */
    uint8_t reserved;

    /** AC Parameters Record WMM_AC_BE, WMM_AC_BK, WMM_AC_VI, WMM_AC_VO */
    IEEEtypes_WmmAcParameters_t ac_params[MAX_AC_QUEUES];

} MLAN_PACK_END  IEEEtypes_WmmParameter_t, *pIEEEtypes_WmmParameter_t;

/* TLV (Tag Length Value) of IEEE IE Type Format */
typedef  struct
{
    uint8_t type;
    uint8_t length; // 数据域的大小
} MLAN_PACK_END IEEEHeader;

// information element parameter
// 所有IEEETypes_*类型的基类型
typedef  struct
{
    IEEEHeader header;
    uint8_t data[1];
} MLAN_PACK_END IEEEType;

typedef  struct _bss_desc_set
{
    uint16_t ie_length; // Total information element length (不含sizeof(ie_length))
    uint8_t bssid[6]; // BSSID
    uint8_t rssi; // RSSI value as received from peer

    // Probe Response/Beacon Payload
    uint64_t pkt_time_stamp; // Timestamp
    uint16_t bcn_interval; // Beacon interval
    uint16_t cap_info; // Capabilities information
    IEEEType ie_parameters; // 存放的是一些IEEE类型的数据
} MLAN_PACK_END bss_desc_set_t,*pbss_desc_set_t;


