sj15712795029/stm32_sdio_wifi_marvell8801_wifi/1-STM32F1_WIFI_综合例程/component/wifi/marvell88w8801_core.h
/** bitmap for get auto deepsleep */
#define BITMAP_AUTO_DS         0x01
/** bitmap for sta power save */
#define BITMAP_STA_PS          0x10
/** bitmap for uap inactivity based PS */
#define BITMAP_UAP_INACT_PS    0x100
/** bitmap for uap DTIM PS */
#define BITMAP_UAP_DTIM_PS     0x200
/** Structure definition for the new ieee power save parameters*/
typedef  struct _auto_ps_param
{
    /** bitmap for enable power save mode */
    uint16_t ps_bitmap;
    /* auto deep sleep parameter, sta power save parameter uap inactivity
       parameter uap DTIM parameter */
} MLAN_PACK_END  auto_ps_param;

/** Structure definition for new power save command */
typedef  struct _HostCmd_DS_PS_MODE_ENH
{
    /** Action */
    uint16_t action;
    /** Data speciifc to action */
    /* For IEEE power save data will be as UINT16 mode (0x01 - firmware to
       automatically choose PS_POLL or NULL mode, 0x02 - PS_POLL, 0x03 -
       NULL mode ) UINT16 NullpacketInterval UINT16 NumDtims UINT16
       BeaconMissInterval UINT16 locallisteninterval UINT16
       adhocawakeperiod */

    /* For auto deep sleep */
    /* UINT16 Deep sleep inactivity timeout */

    /* For PS sleep confirm UINT16 responeCtrl - 0x00 - reponse from fw not
       needed, 0x01 - response from fw is needed */

    union
    {
        /** PS param definition */
        ps_param opt_ps;
        /** Auto ds param definition */
        auto_ds_param auto_ds;
        /** Sleep comfirm param definition */
        sleep_confirm_param sleep_cfm;
        /** bitmap for get PS info and Disable PS mode */
        uint16_t ps_bitmap;
        /** auto ps param */
        auto_ps_param auto_ps;
    } params;
} MLAN_PACK_END  HostCmd_DS_802_11_PS_MODE_ENH;

typedef  struct _hs_config_param
{
    /** bit0=1: broadcast data
      * bit1=1: unicast data
      * bit2=1: mac events
      * bit3=1: multicast data
      */
    uint32_t conditions;
    /** GPIO pin or 0xff for interface */
    uint8_t gpio;
    /** gap in milliseconds or or 0xff for special setting when
     *  GPIO is used to wakeup host
     */
    uint8_t gap;
} MLAN_PACK_END hs_config_param;

/** HS Action 0x0001 - Configure enhanced host sleep mode,
 * 0x0002 - Activate enhanced host sleep mode
 */
typedef enum _Host_Sleep_Action
{
    HS_CONFIGURE = 0x0001,
    HS_ACTIVATE = 0x0002,
} MLAN_PACK_END Host_Sleep_Action;

/** Structure definition for activating enhanced hs */
typedef  struct __hs_activate_param
{
    /** response control 0x00 - response not needed, 0x01 - response needed */
    uint16_t resp_ctrl;
} MLAN_PACK_END  hs_activate_param;

/** HostCmd_DS_802_11_HS_CFG_ENH */
typedef  struct _HostCmd_DS_802_11_HS_CFG_ENH
{
    /** Action 0x0001 - Configure enhanced host sleep mode,
     *  0x0002 - Activate enhanced host sleep mode
     */
    uint16_t action;

    union
    {
        /** Configure enhanced hs */
        hs_config_param hs_config;
        /** Activate enhanced hs */
        hs_activate_param hs_activate;
    } params;
} MLAN_PACK_END  HostCmd_DS_802_11_HS_CFG_ENH;


/** ChanScanMode_t */
typedef  struct _ChanScanMode_t
{
    /** Channel scan mode passive flag */
    uint8_t passive_scan:1;
    /** Disble channel filtering flag */
    uint8_t disable_chan_filt:1;
    /** Multidomain scan mode */
    uint8_t multidomain_scan:1;
    /** Enable probe response timeout */
    uint8_t rsp_timeout_en:1;
    /** Enable hidden ssid report */
    uint8_t hidden_ssid_report:1;
    /** First channel in scan */
    uint8_t first_chan:1;
    /** Reserved */
    uint8_t reserved_6_7:2;
} MLAN_PACK_END ChanScanMode_t;

/** secondary channel is below */
#define SECOND_CHANNEL_BELOW    0x30
/** secondary channel is above */
#define SECOND_CHANNEL_ABOVE    0x10
/** channel offset */
enum
{
    SEC_CHAN_NONE = 0,
    SEC_CHAN_ABOVE = 1,
    SEC_CHAN_BELOW = 3
};
/** channel bandwidth */
enum
{
    CHAN_BW_20MHZ = 0,
    CHAN_BW_10MHZ,
    CHAN_BW_40MHZ,
};
/** ChanScanParamSet_t */
typedef  struct _ChanScanParamSet_t
{
    /** Channel scan parameter : Radio type */
    uint8_t radio_type;
    /** Channel scan parameter : Channel number */
    uint8_t chan_number;
    /** Channel scan parameter : Channel scan mode */
    uint8_t chan_scan_mode;
    /** Channel scan parameter : Minimum scan time */
    uint16_t min_scan_time;
    /** Channel scan parameter : Maximum scan time */
    uint16_t max_scan_time;
} MLAN_PACK_END ChanScanParamSet_t;

/** MrvlIEtypes_ChanListParamSet_t */
typedef  struct _MrvlIEtypes_ChanListParamSet_t
{
    /** Header */
    MrvlIEtypesHeader_t header;
    /** Channel scan parameters */
    ChanScanParamSet_t chan_scan_param[1];
} MLAN_PACK_END MrvlIEtypes_ChanListParamSet_t;

typedef  struct _MrvlIEtypes_SSIDParamSet_t
{
    MrvlIEtypesHeader_t header;
    uint8_t ssid[MAX_SSID_LENGTH];
} MLAN_PACK_END MrvlIEtypes_SSIDParamSet_t;

typedef  struct _MrvlIEtypes_PASSPhrase_t
{
    MrvlIEtypesHeader_t header;
    uint8_t phrase[MAX_PHRASE_LENGTH];
} MLAN_PACK_END MrvlIEtypes_PASSPhrase_t;

typedef  struct _MrvlIEtypes_Enc_Protocol_t
{
    MrvlIEtypesHeader_t header;
    uint16_t enc_protocol;
} MLAN_PACK_END MrvlIEtypes_Enc_Protocol_t;

typedef  struct _MrvlIEtypes_AKMP_t
{
    MrvlIEtypesHeader_t header;
    uint16_t key_mgmt;
    uint16_t operation;
} MLAN_PACK_END MrvlIEtypes_AKMP_t;

#define WPA_CIPHER_WEP40 MBIT(0)
#define WPA_CIPHER_WEP104 MBIT(1)
#define WPA_CIPHER_TKIP MBIT(2)
#define WPA_CIPHER_CCMP MBIT(3)

typedef  struct _MrvlIEtypes_PTK_cipher_t
{
    MrvlIEtypesHeader_t header;
    uint16_t protocol;
    uint16_t cipher;
} MLAN_PACK_END MrvlIEtypes_PTK_cipher_t;

typedef  struct _MrvlIEtypes_GTK_cipher_t
{
    MrvlIEtypesHeader_t header;
    uint16_t cipher;
} MLAN_PACK_END MrvlIEtypes_GTK_cipher_t;


typedef  struct _MrvlIETypes_ApBCast_SSID_Ctrl_t
{
    MrvlIEtypesHeader_t header;
    uint8_t broadcast_ssid;
} MLAN_PACK_END MrvlIETypes_ApBCast_SSID_Ctrl_t;
