sj15712795029/stm32_sdio_wifi_marvell8801_wifi/1-STM32F1_WIFI_综合例程/component/wifi/marvell88w8801_core.h
/*
 * This scan handle Country Information IE(802.11d compliant)
 * Define data structure for HostCmd_CMD_802_11_SCAN
 */
/** HostCmd_DS_802_11_SCAN */
typedef  struct _HostCmd_DS_802_11_SCAN
{
    /** BSS mode */
    uint8_t bss_mode;
    /** BSSID */
    uint8_t bssid[MAC_ADDR_LENGTH];
    /** TLV buffer */
    uint8_t tlv_buffer[1];
    /** MrvlIEtypes_SsIdParamSet_t      SsIdParamSet;
     *  MrvlIEtypes_ChanListParamSet_t  ChanListParamSet;
     *  MrvlIEtypes_RatesParamSet_t     OpRateSet;
     */
} MLAN_PACK_END  HostCmd_DS_802_11_SCAN;

/** HostCmd_DS_RX_MGMT_IND */
typedef  struct _HostCmd_DS_RX_MGMT_IND
{
    /** Action */
    uint16_t action;
    /** Mgmt frame subtype mask */
    uint32_t mgmt_subtype_mask;
} MLAN_PACK_END  HostCmd_DS_RX_MGMT_IND;

/** HostCmd_DS_802_11_SCAN_RSP */
typedef  struct _HostCmd_DS_802_11_SCAN_RSP
{
    /** Size of BSS descriptor */
    uint16_t bss_descript_size;
    /** Numner of sets */
    uint8_t number_of_sets;
    /** BSS descriptor and TLV buffer */
    uint8_t bss_desc_and_tlv_buffer[1];
} MLAN_PACK_END  HostCmd_DS_802_11_SCAN_RSP;

/** HostCmd_DS_802_11_BG_SCAN_CONFIG */
typedef  struct _HostCmd_DS_802_11_BG_SCAN_CONFIG
{
    /** action */
    uint16_t action;
    /** 0: disable, 1: enable */
    uint8_t enable;
    /** bss type */
    uint8_t bss_type;
    /** num of channel per scan */
    uint8_t chan_per_scan;
    /** reserved field */
    uint8_t reserved;
    /** reserved field */
    uint16_t reserved1;
    /** interval between consecutive scans */
    uint32_t scan_interval;
    /** reserved field */
    uint32_t reserved2;
    /** condition to trigger report to host */
    uint32_t report_condition;
    /** reserved field */
    uint16_t reserved3;
} MLAN_PACK_END  HostCmd_DS_802_11_BG_SCAN_CONFIG;

/** HostCmd_DS_802_11_BG_SCAN_QUERY */
typedef  struct _HostCmd_DS_802_11_BG_SCAN_QUERY
{
    /** Flush */
    uint8_t flush;
} MLAN_PACK_END  HostCmd_DS_802_11_BG_SCAN_QUERY;

/** HostCmd_DS_802_11_BG_SCAN_QUERY_RSP */
typedef  struct _HostCmd_DS_802_11_BG_SCAN_QUERY_RSP
{
    /** Report condition */
    uint32_t report_condition;
    /** Scan response */
    HostCmd_DS_802_11_SCAN_RSP scan_resp;
} MLAN_PACK_END  HostCmd_DS_802_11_BG_SCAN_QUERY_RSP;

/** HostCmd_DS_SUBSCRIBE_EVENT */
typedef  struct _HostCmd_DS_SUBSCRIBE_EVENT
{
    /** Action */
    uint16_t action;
    /** Bitmap of subscribed events */
    uint16_t event_bitmap;
} MLAN_PACK_END  HostCmd_DS_SUBSCRIBE_EVENT;

/** HostCmd_DS_OTP_USER_DATA */
typedef  struct _HostCmd_DS_OTP_USER_DATA
{
    /** Action */
    uint16_t action;
    /** Reserved field */
    uint16_t reserved;
    /** User data length */
    uint16_t user_data_length;
    /** User data */
    uint8_t user_data[1];
} MLAN_PACK_END  HostCmd_DS_OTP_USER_DATA;

/** HostCmd_DS_802_11_ASSOCIATE */
typedef  struct _HostCmd_DS_802_11_ASSOCIATE
{
    /** Peer STA address */
    uint8_t peer_sta_addr[MAC_ADDR_LENGTH];
    /** Capability information */
    uint16_t cap_info;
    //IEEEtypes_CapInfo_t cap_info;
    /** Listen interval */
    uint16_t listen_interval;
    /** Beacon period */
    uint16_t beacon_period;
    /** DTIM period */
    uint8_t dtim_period;
    uint8_t tlv_buffer[1];
    /**
     *  MrvlIEtypes_SsIdParamSet_t  SsIdParamSet;
     *  MrvlIEtypes_PhyParamSet_t   PhyParamSet;
     *  MrvlIEtypes_SsParamSet_t    SsParamSet;
     *  MrvlIEtypes_RatesParamSet_t RatesParamSet;
     */
} MLAN_PACK_END  HostCmd_DS_802_11_ASSOCIATE;

/** HostCmd_CMD_802_11_ASSOCIATE response */
typedef  struct _HostCmd_DS_802_11_ASSOCIATE_RSP
{
    /** Association response structure */
    IEEEtypes_AssocRsp_t assoc_rsp;
} MLAN_PACK_END  HostCmd_DS_802_11_ASSOCIATE_RSP;

/**  HostCmd_CMD_802_11_DEAUTHENTICATE */
typedef  struct _HostCmd_DS_802_11_DEAUTHENTICATE
{
    /** MAC address */
    uint8_t mac_addr[MAC_ADDR_LENGTH];
    /** Deauthentication resaon code */
    uint16_t reason_code;
} MLAN_PACK_END  HostCmd_DS_802_11_DEAUTHENTICATE;

/** HostCmd_DS_802_11_AD_HOC_START*/
typedef  struct _HostCmd_DS_802_11_AD_HOC_START
{
    /** AdHoc SSID */
    uint8_t ssid[MAX_SSID_LENGTH];
    /** BSS mode */
    uint8_t bss_mode;
    /** Beacon period */
    uint16_t beacon_period;
    /** DTIM period */
    uint8_t dtim_period;
    /** SS parameter set */
    IEEEtypes_SsParamSet_t ss_param_set;
    /** PHY parameter set */
    IEEEtypes_PhyParamSet_t phy_param_set;
    /** Reserved field */
    uint16_t reserved1;
    /** Capability information */
    IEEEtypes_CapInfo_t cap;
    /** Supported data rates */
    uint8_t DataRate[HOSTCMD_SUPPORTED_RATES];
} MLAN_PACK_END  HostCmd_DS_802_11_AD_HOC_START;

/**  HostCmd_CMD_802_11_AD_HOC_START response */
typedef  struct _HostCmd_DS_802_11_AD_HOC_START_RESULT
{
    /** Padding */
    uint8_t pad[3];
    /** AdHoc BSSID */
    uint8_t bssid[MAC_ADDR_LENGTH];
    /** Padding to sync with FW structure*/
    uint8_t pad2[2];
    /** Result */
    uint8_t result;
} MLAN_PACK_END  HostCmd_DS_802_11_AD_HOC_START_RESULT;

/**  HostCmd_CMD_802_11_AD_HOC_START response */
typedef  struct _HostCmd_DS_802_11_AD_HOC_JOIN_RESULT
{
    /** Result */
    uint8_t result;
} MLAN_PACK_END  HostCmd_DS_802_11_AD_HOC_JOIN_RESULT;

/** AdHoc_BssDesc_t */
typedef  struct _AdHoc_BssDesc_t
{
    /** BSSID */
    uint8_t bssid[MAC_ADDR_LENGTH];
    /** SSID */
    uint8_t ssid[MAX_SSID_LENGTH];
    /** BSS mode */
    uint8_t bss_mode;
    /** Beacon period */
    uint16_t beacon_period;
    /** DTIM period */
    uint8_t dtim_period;
    /** Timestamp */
    uint8_t time_stamp[8];
    /** Local time */
    uint8_t local_time[8];
    /** PHY parameter set */
    IEEEtypes_PhyParamSet_t phy_param_set;
    /** SS parameter set */
    IEEEtypes_SsParamSet_t ss_param_set;
    /** Capability information */
    IEEEtypes_CapInfo_t cap;
    /** Supported data rates */
    uint8_t data_rates[HOSTCMD_SUPPORTED_RATES];

