sj15712795029/stm32_sdio_wifi_marvell8801_wifi/1-STM32F1_WIFI_综合例程/component/wifi/marvell88w8801_core.h
    /*
     *  DO NOT ADD ANY FIELDS TO THIS STRUCTURE.
     *  It is used in the Adhoc join command and will cause a
     *  binary layout mismatch with the firmware
     */
} MLAN_PACK_END  AdHoc_BssDesc_t;

/** HostCmd_DS_802_11_AD_HOC_JOIN */
typedef  struct _HostCmd_DS_802_11_AD_HOC_JOIN
{
    /** AdHoc BSS descriptor */
    AdHoc_BssDesc_t bss_descriptor;
    /** Reserved field */
    uint16_t reserved1;
    /** Reserved field */
    uint16_t reserved2;
} MLAN_PACK_END  HostCmd_DS_802_11_AD_HOC_JOIN;

/** MrvlIEtypes_DomainParamSet_t */
typedef  struct _MrvlIEtypes_DomainParamSet
{
    /** Header */
    MrvlIEtypesHeader_t header;
    /** Country code */
    uint8_t country_code[COUNTRY_CODE_LEN];
    /** Set of subbands */
    IEEEtypes_SubbandSet_t sub_band[1];
} MLAN_PACK_END  MrvlIEtypes_DomainParamSet_t;

/** HostCmd_DS_802_11D_DOMAIN_INFO */
typedef  struct _HostCmd_DS_802_11D_DOMAIN_INFO
{
    /** Action */
    uint16_t action;
    /** Domain parameter set */
    MrvlIEtypes_DomainParamSet_t domain;
} MLAN_PACK_END  HostCmd_DS_802_11D_DOMAIN_INFO;

/** HostCmd_DS_802_11D_DOMAIN_INFO_RSP */
typedef  struct _HostCmd_DS_802_11D_DOMAIN_INFO_RSP
{
    /** Action */
    uint16_t action;
    /** Domain parameter set */
    MrvlIEtypes_DomainParamSet_t domain;
} MLAN_PACK_END  HostCmd_DS_802_11D_DOMAIN_INFO_RSP;

/** HostCmd_DS_11N_ADDBA_REQ */
typedef  struct _HostCmd_DS_11N_ADDBA_REQ
{
    /** Result of the ADDBA Request Operation */
    uint8_t add_req_result;
    /** Peer MAC address */
    uint8_t peer_mac_addr[MAC_ADDR_LENGTH];
    /** Dialog Token */
    uint8_t dialog_token;
    /** Block Ack Parameter Set */
    uint16_t block_ack_param_set;
    /** Block Act Timeout Value */
    uint16_t block_ack_tmo;
    /** Starting Sequence Number */
    uint16_t ssn;
} MLAN_PACK_END  HostCmd_DS_11N_ADDBA_REQ;

/** HostCmd_DS_11N_ADDBA_RSP */
typedef  struct _HostCmd_DS_11N_ADDBA_RSP
{
    /** Result of the ADDBA Response Operation */
    uint8_t add_rsp_result;
    /** Peer MAC address */
    uint8_t peer_mac_addr[MAC_ADDR_LENGTH];
    /** Dialog Token */
    uint8_t dialog_token;
    /** Status Code */
    uint16_t status_code;
    /** Block Ack Parameter Set */
    uint16_t block_ack_param_set;
    /** Block Act Timeout Value */
    uint16_t block_ack_tmo;
    /** Starting Sequence Number */
    uint16_t ssn;
} MLAN_PACK_END  HostCmd_DS_11N_ADDBA_RSP;

/** HostCmd_DS_11N_DELBA */
typedef  struct _HostCmd_DS_11N_DELBA
{
    /** Result of the ADDBA Request Operation */
    uint8_t del_result;
    /** Peer MAC address */
    uint8_t peer_mac_addr[MAC_ADDR_LENGTH];
    /** Delete Block Ack Parameter Set */
    uint16_t del_ba_param_set;
    /** Reason Code sent for DELBA */
    uint16_t reason_code;
    /** Reserved */
    uint8_t reserved;
} MLAN_PACK_END  HostCmd_DS_11N_DELBA;

/** HostCmd_DS_TXBUF_CFG*/
typedef  struct _HostCmd_DS_TXBUF_CFG
{
    /** Action */
    uint16_t action;
    /** Buffer Size */
    uint16_t buff_size;
    /** End Port_for Multiport */
    uint16_t mp_end_port;
    /** Reserved */
    uint16_t reserved3;
}  HostCmd_DS_TXBUF_CFG;

/** HostCmd_DS_AMSDU_AGGR_CTRL */
typedef  struct _HostCmd_DS_AMSDU_AGGR_CTRL
{
    /** Action */
    uint16_t action;
    /** Enable */
    uint16_t enable;
    /** Get the current Buffer Size valid */
    uint16_t curr_buf_size;
} MLAN_PACK_END  HostCmd_DS_AMSDU_AGGR_CTRL;

/** HostCmd_DS_11N_CFG */
typedef  struct _HostCmd_DS_11N_CFG
{
    /** Action */
    uint16_t action;
    /** HTTxCap */
    uint16_t ht_tx_cap;
    /** HTTxInfo */
    uint16_t ht_tx_info;
    /** Misc configuration */
    uint16_t misc_config;
} MLAN_PACK_END  HostCmd_DS_11N_CFG;

/** HostCmd_DS_11N_CFG */
typedef  struct _HostCmd_DS_REJECT_ADDBA_REQ
{
    /** Action */
    uint16_t action;
    /** Bit0    : host sleep activated
     *  Bit1    : auto reconnect enabled
     *  Others  : reserved
     */
    uint32_t conditions;
} MLAN_PACK_END  HostCmd_DS_REJECT_ADDBA_REQ;


/** MrvlIEtypes_WmmQueueStatus_t */
typedef  struct
{
    /** Header */
    MrvlIEtypesHeader_t header;
    /** Queue index */
    uint8_t queue_index;
    /** Disabled flag */
    uint8_t disabled;
    /** Medium time allocation in 32us units*/
    uint16_t medium_time;
    /** Flow required flag */
    uint8_t flow_required;
    /** Flow created flag */
    uint8_t flow_created;
    /** Reserved */
    uint32_t reserved;
} MLAN_PACK_END  MrvlIEtypes_WmmQueueStatus_t;

/**
 *  @brief Firmware command structure to retrieve the firmware WMM status.
 *
 *  Used to retrieve the status of each WMM AC Queue in TLV
 *    format (MrvlIEtypes_WmmQueueStatus_t) as well as the current WMM
 *    parameter IE advertised by the AP.
 *
 *  Used in response to a EVENT_WMM_STATUS_CHANGE event signaling
 *    a QOS change on one of the ACs or a change in the WMM Parameter in
 *    the Beacon.
 *
 *  TLV based command, byte arrays used for max sizing purpose. There are no
 *    arguments sent in the command, the TLVs are returned by the firmware.
 */
typedef  struct
{
    /** Queue status TLV */
    uint8_t queue_status_tlv[sizeof(MrvlIEtypes_WmmQueueStatus_t)
                             * MAX_AC_QUEUES];
    /** WMM parameter TLV */
    uint8_t wmm_param_tlv[sizeof(IEEEtypes_WmmParameter_t) + 2];
} MLAN_PACK_END  HostCmd_DS_WMM_GET_STATUS;

/** Type enumeration for the command result */
typedef  enum _mlan_cmd_result_e
{
    MLAN_CMD_RESULT_SUCCESS = 0,
    MLAN_CMD_RESULT_FAILURE = 1,
    MLAN_CMD_RESULT_TIMEOUT = 2,
    MLAN_CMD_RESULT_INVALID_DATA = 3
} MLAN_PACK_END  mlan_cmd_result_e;

/**
 *  @brief Command structure for the HostCmd_CMD_WMM_ADDTS_REQ firmware command
 */
typedef  struct
{
    mlan_cmd_result_e command_result;/**< Command result */
    uint32_t timeout_ms;		 /**< Timeout value in milliseconds */
    uint8_t dialog_token;		 /**< Dialog token */
    uint8_t ieee_status_code;		 /**< IEEE status code */
    uint8_t tspec_data[WMM_TSPEC_SIZE]; /**< TSPEC data */
    uint8_t addts_extra_ie_buf[WMM_ADDTS_EXTRA_IE_BYTES];
    /**< Extra IE buffer */
} MLAN_PACK_END  HostCmd_DS_WMM_ADDTS_REQ;

/**
 *  @brief Command structure for the HostCmd_CMD_WMM_DELTS_REQ firmware command
 */
typedef  struct
{
    mlan_cmd_result_e command_result;
    /**< Command result */
    uint8_t dialog_token;		/**< Dialog token */
    uint8_t ieee_reason_code;		/**< IEEE reason code */
    uint8_t tspec_data[WMM_TSPEC_SIZE];/**< TSPEC data */
} MLAN_PACK_END  HostCmd_DS_WMM_DELTS_REQ;

/**
 *  @brief Enumeration for the action field in the Queue configure command
 */
typedef enum
{
    WMM_QUEUE_CONFIG_ACTION_GET = 0,
    WMM_QUEUE_CONFIG_ACTION_SET = 1,
    WMM_QUEUE_CONFIG_ACTION_DEFAULT = 2,

    WMM_QUEUE_CONFIG_ACTION_MAX
} MLAN_PACK_END  mlan_wmm_queue_config_action_e;

