sj15712795029/stm32_sdio_wifi_marvell8801_wifi/1-STM32F1_WIFI_综合例程/component/wifi/marvell88w8801_core.h
/*
 * This struct will GET the Supplicant supported bitmaps
 * The GET_CURRENT action will get the network profile used
 * for the current assocation.
 * Define data structure for HostCmd_CMD_802_11_SUPPLICANT_PROFILE
 */
typedef  struct _HostCmd_DS_802_11_SUPPLICANT_PROFILE
{
    /** GET/SET/GET_CURRENT */
    uint16_t action;
    /** Reserved */
    uint16_t reserved;
    /** TLVBuffer */
    uint8_t tlv_buf[1];
    /* MrvlIEtypes_EncrProto_t */
} MLAN_PACK_END  HostCmd_DS_802_11_SUPPLICANT_PROFILE;

/** HostCmd_DS_VERSION_EXT */
typedef  struct _HostCmd_DS_VERSION_EXT
{
    /** Selected version string */
    uint8_t version_str_sel;
    /** Version string */
    char version_str[128];
} MLAN_PACK_END  HostCmd_DS_VERSION_EXT;

/** HostCmd_DS_802_11_IBSS_STATUS */
typedef  struct _HostCmd_DS_802_11_IBSS_STATUS
{
    /** Action */
    uint16_t action;
    /** Enable */
    uint16_t enable;
    /** BSSID */
    uint8_t bssid[MAC_ADDR_LENGTH];
    /** Beacon interval */
    uint16_t beacon_interval;
    /** ATIM window interval */
    uint16_t atim_window;
    /** User G rate protection */
    uint16_t use_g_rate_protect;
} MLAN_PACK_END HostCmd_DS_802_11_IBSS_STATUS;

/** custom IE info */
typedef struct _custom_ie_info
{
    /** size of buffer */
    uint16_t buf_size;
    /** no of buffers of buf_size */
    uint16_t buf_count;
} MLAN_PACK_END custom_ie_info;

/** TLV buffer : Max Mgmt IE */
typedef  struct _tlvbuf_max_mgmt_ie
{
    /** Type */
    uint16_t type;
    /** Length */
    uint16_t len;
    /** No of tuples */
    uint16_t count;
    /** custom IE info tuples */
    custom_ie_info info[MAX_MGMT_IE_INDEX];
} MLAN_PACK_END  tlvbuf_max_mgmt_ie;

/** custom IE */
typedef struct _custom_ie
{
    /** IE Index */
    uint16_t ie_index;
    /** Mgmt Subtype Mask */
    uint16_t mgmt_subtype_mask;
    /** IE Length */
    uint16_t ie_length;
    /** IE buffer */
    uint8_t ie_buffer[0];
} MLAN_PACK_END  custom_ie;

/** TLV buffer : custom IE */
typedef  struct _tlvbuf_custom_ie
{
    /** Type */
    uint16_t type;
    /** Length */
    uint16_t len;
    /** IE data */
    custom_ie ie_data_list[MAX_MGMT_IE_INDEX_TO_FW];
    /** Max mgmt IE TLV */
    tlvbuf_max_mgmt_ie max_mgmt_ie;
} MLAN_PACK_END  mlan_ds_misc_custom_ie;

/** HostCmd_DS_MGMT_IE_LIST_CFG */
typedef  struct _HostCmd_DS_MGMT_IE_LIST
{
    /** Action */
    uint16_t action;
    /** Get/Set mgmt IE */
    mlan_ds_misc_custom_ie ds_mgmt_ie;
} MLAN_PACK_END  HostCmd_DS_MGMT_IE_LIST_CFG;



/** HostCmd_DS_ECL_SYSTEM_CLOCK_CONFIG */
typedef  struct _HostCmd_DS_ECL_SYSTEM_CLOCK_CONFIG
{
    /** Action */
    uint16_t action;
    /** Current system clock */
    uint16_t cur_sys_clk;
    /** Clock type */
    uint16_t sys_clk_type;
    /** Length of clocks */
    uint16_t sys_clk_len;
    /** System clocks */
    uint16_t sys_clk[16];
} MLAN_PACK_END  HostCmd_DS_ECL_SYSTEM_CLOCK_CONFIG;

/** HostCmd_CMD_MAC_REG_ACCESS */
typedef  struct _HostCmd_DS_MAC_REG_ACCESS
{
    /** Action */
    uint16_t action;
    /** MAC register offset */
    uint16_t offset;
    /** MAC register value */
    uint32_t value;
} MLAN_PACK_END  HostCmd_DS_MAC_REG_ACCESS;

/** HostCmd_CMD_BBP_REG_ACCESS */
typedef  struct _HostCmd_DS_BBP_REG_ACCESS
{
    /** Acion */
    uint16_t action;
    /** BBP register offset */
    uint16_t offset;
    /** BBP register value */
    uint8_t value;
    /** Reserved field */
    uint8_t reserved[3];
} MLAN_PACK_END  HostCmd_DS_BBP_REG_ACCESS;

/**  HostCmd_CMD_RF_REG_ACCESS */
typedef  struct _HostCmd_DS_RF_REG_ACCESS
{
    /** Action */
    uint16_t action;
    /** RF register offset */
    uint16_t offset;
    /** RF register value */
    uint8_t value;
    /** Reserved field */
    uint8_t reserved[3];
} MLAN_PACK_END  HostCmd_DS_RF_REG_ACCESS;

/** HostCmd_DS_802_11_EEPROM_ACCESS */
typedef  struct _HostCmd_DS_802_11_EEPROM_ACCESS
{
    /** Action */
    uint16_t action;

    /** multiple 4 */
    uint16_t offset;
    /** Number of bytes */
    uint16_t byte_count;
    /** Value */
    uint8_t value;
} MLAN_PACK_END HostCmd_DS_802_11_EEPROM_ACCESS;

/** HostCmd_DS_MEM_ACCESS */
typedef  struct _HostCmd_DS_MEM_ACCESS
{
    /** Action */
    uint16_t action;
    /** Reserved field */
    uint16_t reserved;
    /** Address */
    uint32_t addr;
    /** Value */
    uint32_t value;
} MLAN_PACK_END  HostCmd_DS_MEM_ACCESS;

/** HostCmd_DS_TARGET_ACCESS */
typedef  struct _HostCmd_DS_TARGET_ACCESS
{
    /** Action */
    uint16_t action;
    /** CSU Target Device. 1: CSU, 2: PSU */
    uint16_t csu_target;
    /** Target Device Address */
    uint16_t address;
    /** Data */
    uint8_t data;
} MLAN_PACK_END  HostCmd_DS_TARGET_ACCESS;

/** HostCmd_DS_INACTIVITY_TIMEOUT_EXT */
typedef  struct _HostCmd_DS_INACTIVITY_TIMEOUT_EXT
{
    /** ACT_GET/ACT_SET */
    uint16_t action;
    /** uS, 0 means 1000uS(1ms) */
    uint16_t timeout_unit;
    /** Inactivity timeout for unicast data */
    uint16_t unicast_timeout;
    /** Inactivity timeout for multicast data */
    uint16_t mcast_timeout;
    /** Timeout for additional RX traffic after Null PM1 packet exchange */
    uint16_t ps_entry_timeout;
    /** Reserved to further expansion */
    uint16_t reserved;
} MLAN_PACK_END  HostCmd_DS_INACTIVITY_TIMEOUT_EXT;

/** HostCmd_SYS_CONFIG */
typedef  struct _HostCmd_DS_SYS_CONFIG
{
    /** CMD Action GET/SET*/
    uint16_t action;
    /** Tlv buffer */
    uint8_t tlv_buffer[1];
} MLAN_PACK_END  HostCmd_DS_SYS_CONFIG;

/** HostCmd_SYS_CONFIG */
typedef  struct _HostCmd_DS_SYS_INFO
{
    /** sys info */
    uint8_t sys_info[64];
} MLAN_PACK_END  HostCmd_DS_SYS_INFO;

/** HostCmd_DS_STA_DEAUTH */
typedef  struct _HostCmd_DS_STA_DEAUTH
{
    /** mac address */
    uint8_t mac[MAC_ADDR_LENGTH];
    /** reason code */
    uint16_t reason;
} MLAN_PACK_END  HostCmd_DS_STA_DEAUTH;

